# Brewfile - Homebrew Bundle
# Install with: brew bundle --file=~/dotfiles/Brewfile

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Shell & Prompt
brew "starship"       # Cross-shell prompt
brew "atuin"          # Shell history with sync

# Modern CLI Replacements
brew "eza"            # Better ls
brew "bat"            # Better cat
brew "zoxide"         # Smarter cd
brew "fzf"            # Fuzzy finder
brew "fd"             # Better find
brew "ripgrep"        # Better grep
brew "git-delta"      # Better git diff
brew "lazygit"        # Git TUI

# Data Processing
brew "jq"             # JSON processor
brew "yq"             # YAML processor

# Development Tools
brew "gh"             # GitHub CLI
brew "pipx"           # Python app installer

# Version Managers (optional - uncomment if needed)
# brew "nvm"          # Node version manager
# brew "pyenv"        # Python version manager

# Fonts (Nerd Font patched)
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace-nerd-font"

# Apps
cask "iterm2"
cask "visual-studio-code"
